NTOMATOTIMER README


Το αρχείο αυτό περιέχει:


Λίγα λόγια για το πρόγραμμα

            + 

Οδηγίες για compilation

-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


Λίγα λόγια για το πρόγραμμα



Η δημιουργία αυτού του προγράμματος ξεκίνησε 5 ημέρες μετά την ανάθεση της εργασίας.

Στην αρχή ξεκίνησε με την ανάπτυξη αλγορίθμων για το timer και το πως να τρέξει σωτά.

Ουσιαστικά, στα αρχικά στάδια έφτιαχνα προγράμματα ΣΤΗ C, για να δοκιμάσω λειτουργίες.

Μόλις κατάφερα να φτιάξω ένα λειτουργικό χρονόμετρο, πήγα από C -> C++

Έτσι έφτιαξα ένα ΠΟΛΥ απλό πρόγραμμα όπου όλα ήταν public (αντιμετώπιζα τις κλάσεις ως structs) λόγω έλλειψης γνώσεων

Μία ημέρα μετά, έκανα εξάσκηση σε πολλά από τα σημεία της c++ (κατασκευαστές, getters, setters κτλπ) και σιγά σιγά το πρόγραμμα μου εξελισσόταν

Έφτασα σε ένα σημείο που το πρόγραμμα λειτουργούσε (με κλάσεις κτλπ) αλλά αισθανόμουν... ΟΤΙ ΜΠΟΡΕΙ ΝΑ ΓΙΝΕΙ ΚΑΛΥΤΕΡΟ

Για αυτό, αποφάσισα να βάλω εξτρά λειτουργίες, πχ να μπορεί ο χρήστης να βγεί από το session και να συνεχίσει είτε από το διάλλειμα είτε από τον χρόνο εργασίας, να βάλω ήχο τον οποίο 
ΕΓΩ ηχογράφησα στο Audacity λέγοντας τη φράση "δωδ".

Μιας και ανέφερα το δωδ, δωδ είναι το όνομα της μασκότ αυτής της εφαρμογής.  Συγκεκριμένα, ενώ έφτιαχνα ένα μεγάλο μέρος της εφαρμογής, ήμουν σε κλήση με τη κοπέλα μου και
με ρώτησε τι σημαίνει η λέξη "pomodro" και της είπα "It means tomato" και με ρωτάει "What is it called in Greek?" και της λέω ντομάτα, και εκείνη άκουσε δωδμαδα.

Και έτσι σκέφτηκα το δωδ και της ήρθε η ιδέα, αφού σπουδάζει design and Media production, να φτιάξει ένα εικονίδιο για την εφαρμογή χρησιμοποιώντας adobe illustrator.

Την ίδια στιγμή, έκανα το μεγάλο λάθος να θέσω όλες τις μεταβλητές GLOBAL και έπρεπε να τις αλλάξω...

Επίσης είχα να σκεφτώ διάφορους αλγόριθμους και τεχνικές για να αποφυγώ το ενδεχόμενο ο χρήστης να μπορεί να εισάγει "μη έγκυρα" δεδομένα.

Με πολύ ψάξιμο και προσπάθεια, τα κατάφερα!

Τέλος, έπρεπε να φτιάξω τα αρχεία κειμένου, που το κατάφερα... ΑΛΛΑ ΤΟ ΝΑ ΦΤΙΑΞΩ ΤΟ TOTALWORKTIME ΑΡΧΕΙΟ ΝΑ ΛΕΙΤΟΥΡΓΕΙ ΣΩΣΤΑ ΜΟΥ ΠΗΡΕ 3 ΗΜΕΡΕΣ.

Ύστερα δοκίμασα πράγματα με το design της εφαρμογής π.χ με τα χρώματα, το box design για τα στατιστικά.

Φτάνουμε τώρα στο σήμερα, όπου πλέον το πρόγραμμα έχει headfile, sourcefile και main και το έκανα compile.

Τις εντολές για το compile της βρήκα μέσω stackoverflow + μέσω ενός IDE (Code::Blocks).

-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


Compilation και εκκίνηση εφαρμογής:

Η μορφή του zip (με τον φάκελο obj κτλπ) είναι εμπνευσμένη από κάποια totorial που είδα στο youtube για το πως φτιάχνονται 
"σωστά" οι εφαρμογές. Βέβαια εκείνοι είχαν φάκελο για debugging κτλπ.

Βρείτε καταρχάς τη θέση του αρχείου και πηγαίνετε στο cmd.

Κατόπιν, πληκτρολογίστε τα εξής (για compilation):

g++ -c ntomatotimer.cpp
g++ -c main.cpp

g++.exe  -o ntomatotimer.exe obj\Release\main.o obj\Release\ntomatotimer.o  obj\Release\ntom.res -s -static-libstdc++ -static-libgcc  -lwinmm

(κάνω link winmm για να λειτουργήσει το αρχείο ήχου μου)

-------------------------

Για να τρέξει από cmd:
ntomatotimer.exe

Αλλιώς,

Κλικ στο ntomatotimer.exe (αυτό με το εικονίδιο με τη ντομάτα).


-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Λειτουργία εφαρμογής



ΜΕΝΟΥ



Το κυρίως μενού επιλογών έχει 5 βασικές επιλογές.

Πατώντας το 1, ο χρήστης ξεκινάει μια συνεδρία. Αν ο χρήστης δεν έχει πάει στα settings, το χρονόμετρο της εργασίας θα είναι 25 λεπτά, και του διαλείμματος 5.

Πατώντας το 2, ο χρήστης μπορεί να τροποποιήσει τον χρόνο του κάθε χρονομέτρου. Οι τιμές που μπορεί να εισάγει είναι στο διάστημα Χε[1,999]. Αν προσπαθήσει να βάλει
οποιαδήποτε άλλη τιμή, θα του εμφανιστεί μήνυμα σφάλματος.

Πατώντας το 3, ο χρήστης μπορεί να δει τον αριθμό των συνεδριών που έχουν ολοκληρωθεί και το πόσο χρόνο έχουν σπαταλίσει στο χρονόμετρο της εργασίας

Πατώντας το 4, ο χρήστης μπορεί να βγει από την εφαρμογή.

Πατώντας το 5, θα εμφανιστούν τα credits.



ΧΡΟΝΟΜΕΤΡΑ

Ενώ τα χρονόμετρα τρέχουν, ο χρήστης μπορεί να εκτελέσει κάποιες ορισμένες λειτουργίες.

1) Πατώντας το "ESC" ο χρήστης θα δει δύο επιλογές
          i) Yes, που αν πατηθεί το "1" ο χρήστης θα γυρίσει πίσω στο κυρίως μενού.
          ii) No, όπου αν πατηθεί το "2" απλά θα συνεχίσει από εκεί που έμεινε.

2) Πατώνας το "SPACEBAR" ο χρήστης μπορεί να κάνει παύση του χρόνου.
Και πατώντας ΟΠΟΙΟΔΗΠΟΤΕ ΚΟΥΜΠΙ ΠΕΡΑ ΤΟΥ SPACEBAR, το χρονόμετρο θα συνεχίσει να μετρά.

To "SPACEBAR" ειναι ΜΟΝΟ για παύση των χρονομέτρων, και όχι για unpause.

Στη συνέχεια, μολίς το χρονόμετρο της εργασίας μηδενιστεί, 
θα παίξει τρεις φορές ένας ήχος, και έπειτα θα εμφανιστούν δύο επιλογές στον χρήστη, για το αν θέλει να προχωρήσει με το διαλειμμα

1) Yes, που αν το επιλέξει θα ξεκινήσει το χρονόμετρο για το διάλειμμα.
2) Να μη κάνει το διάλειμμα
Αν πατηθεί η 2η επιλογή, θα εμφανιστεί μήνυμα "Press 1 to continue with the same settings" .

Αν ο χρήστης πατήσει το "1", ο χρήστης θα συνεχίσει ΑΠΟ ΤΟ ΔΙΑΛΕΙΜΜΑ.
Σε διαφορετική περίπτωση, ο χρήστης θα επιστρέφει πίσω στο κυρίως μενύ.

Τελευταία λειτουργία που έχουν τα χρονόμετρα, είναι πως μόλις τελειώσει το χρονόμετρο του διαλείμματος, ο χρήστης μπορεί να κάνει άλλο ένα session με τα ίδια settings απο πριν.
Αυτό βοηθάει στο να μη χρειάζεται κάθε φορά που ο χρήστης θέλει να τρέξει το πρόγραμμα να πρέπει μα πηγαίνει στα settings και να αλλάζει τις τιμές.



Στατιστικά

Ο χρήστης πατώντας το "3" στο κυρίως μενού μπορεί να δεί τα στατιστικά του.

Συγκεκριμένα, έχει τη δυνατότητα να δεί πόσα συνολικά Sessions έχει ολοκληρώσει πλήρως, και τον συνολικό χρόνο που έχει αφιερώσει στο χρονόμετρο
για την εργασία.

Πίσω από τα στατιστικά αυτά, "κρύβονται" αρχεία κειμένου .txt που κάθε φορά που ο χρήστης τρέχει το πρόγραμμα, ενημερώνονται με νέα δεδομένα.


Σε περίπτωση που για τον οποιοδήποτε λόγο ο χρήστης διαγράψει τα αρχεία κειμένου, δεν θα υπάρξει πρόβλημα στη λειτουργία των στατιστικών,
αφού κάθε φορά που ο χρήστης εκτελεί το πρόγραμμα, γίνεται έλεγχος για το αν υπάρχουν τα αρχεία, και σε περίπτωση που
δεν υπάρχουν, τα δημιουργεί το πρόγραμμα μόνο του (τα οποία προφανώς, είναι αρχικοποιημένα με τιμή 0).
